let a = 
{
"ヘイラッシャ":["みず",225,167,135,76,117,55,"てんねん","とつげきチョッキ","じしん","ゆきなだれ","ボディプレス"],
"ハバタクカミ":["ゴースト・フェアリー",130,67,75,187,155,205,"こだいかっせい","ブーストエナジー","シャドーボール","サイコショック","マジカルフレイム"],
"ロトム(ウォッシュ)":["みず・でんき",157,76,127,172,127,106,"ふゆう","こだわりメガネ","10まんボルト","シャドーボール","イカサマ"],
"オーガポン(かまど)":["くさ・ほのお",155,172,104,72,116,178,"かたやぶり","かまどのめん","じゃれつく","ウッドホーン","じごくづき"],
"イーユイ":["ほのお・あく",130,90,100,187,140,167,"わざわいのたま","こだわりスカーフ","かえんほうしゃ","あくのはどう","サイコキネシス"],
"テツノカイナ":["でんき・かくとう",229,211,128,63,120,70,"クォークチャージ","パンチグローブ","かみなりパンチ","れいとうパンチ","じしん"],
"ガブリアス":["じめん・ドラゴン",183,182,115,90,105,169,"さめはだ","こだわりハチマキ","じしん","いわなだれ","アイアンヘッド"],
"ヌメルゴン(ヒスイ)":["はがね・ドラゴン",187,120,120,178,170,72,"シェルアーマー","たべのこし","10まんボルト","ラスターカノン","じしん"],
"ギャラドス":["みず・ひこう",202,194,99,72,120,101,"いかく","ゴツゴツメット","じしん","アイアンヘッド","こおりのキバ"],
"テツノブジン":["フェアリー・かくとう",149,150,110,172,72,184,"クォークチャージ","きあいのタスキ","インファイト","10まんボルト","シャドーボール"],
}