let a = 
{
"ヘイラッシャ":["みず",225,167,135,76,117,55,"てんねん","とつげきチョッキ","相手に与えたダメージの33%を自分も受ける。","じしん","ゆきなだれ","ボディプレス"],
"ハバタクカミ":["ゴースト・フェアリー",130,67,75,187,155,205,"こだいかっせい","ブーストエナジー","30%の確率で相手の『とくこう』ランクを1段階下げる。","シャドーボール","サイコショック","マジカルフレイム"],
"ロトム(ウォッシュ)":["みず・でんき",157,76,127,172,127,106,"ふゆう","こだわりメガネ","通常攻撃。","10まんボルト","シャドーボール","イカサマ"],
"オーガポン(かまど)":["くさ・ほのお",155,172,104,72,116,178,"かたやぶり","かまどのめん","『オーガポン』が使う場合、持たせた「おめん」によるフォルムに合わせて、技が『くさ』『ほのお』『みず』『いわ』タイプのいずれかに変化する。また、急所に当たりやすい(急所ランク:+1)。","じゃれつく","ウッドホーン","じごくづき"],
"イーユイ":["ほのお・あく",130,90,100,187,140,167,"わざわいのたま","こだわりスカーフ","攻撃後、100%の確率で自分の『とくこう』ランクが2段階下がる。","かえんほうしゃ","あくのはどう","サイコキネシス"],
"テツノカイナ":["でんき・かくとう",229,211,128,63,120,70,"クォークチャージ","パンチグローブ","相手に与えたダメージの半分だけ自分のHPが回復する。特性『てつのこぶし』の時、威力が1.2倍になる。","かみなりパンチ","れいとうパンチ","じしん"],
"ガブリアス":["じめん・ドラゴン",183,182,115,90,105,169,"さめはだ","こだわりハチマキ","通常攻撃。","じしん","いわなだれ","アイアンヘッド"],
"ヌメルゴン(ヒスイ)":["はがね・ドラゴン",187,120,120,178,170,72,"シェルアーマー","たべのこし","10%の確率で相手を『こおり』状態にする。","10まんボルト","ラスターカノン","じしん"],
"ギャラドス":["みず・ひこう",202,194,99,72,120,101,"いかく","ゴツゴツメット","20%の確率で相手をひるませる。","じしん","アイアンヘッド","こおりのキバ"],
"テツノブジン":["フェアリー・かくとう",149,150,110,172,72,184,"クォークチャージ","きあいのタスキ","30%の確率で相手の『とくこう』ランクを1段階下げる。","インファイト","10まんボルト","シャドーボール"],


}