let text = ""
for (let i = 0; i < document.querySelectorAll("table td:not(:has(th))").length - 1; i += 2) {
    text += document.getElementsByTagName("table")[0].querySelectorAll("td:not(:has(th))")[i].innerText
    text += ","
    text += document.getElementsByTagName("table")[0].querySelectorAll("td:not(:has(th))")[i + 1].innerText
    text += "\n"
}
console.log(text)

/*持ち物*/
let t = ""
for (let i = 0; i < document.querySelectorAll("td:not(:has(th))").length / 2 - 1; i += 3) {
    if (document.querySelectorAll("td:not(:has(th))")[i + 1].innerText.match("持たせると") !== null) {
        t += document.querySelectorAll("td:not(:has(th))")[i].innerText
        t += ","
        t += document.querySelectorAll("td:not(:has(th))")[i + 1].innerHTML
            .replace(/<img[^<>]*?alt="([^<>]*?)".+?>/g, "($1)")
            .replace(/<img[^<>]+?>/g, "")
            .replace(/<a[^<>]*?>|<\/a>/g, "")
            .replace(/<span.*?>|<\/span>/g, "")
        t += "\n"
    }
}
console.log(t)

/* 日英翻訳 */
text = ""
const filter_item = ["あおぞらプレート", "あかいいと", "あついいわ", "あつぞこブーツ", "いかさまダイス", "いかずちプレート", "いのちのたま", "エレキシード", "おうじゃのしるし", "おおきなねっこ", "おまもりこばん", "おんみつマント", "かいがらのすず", "かえんだま", "かたいいし", "からぶりほけん", "かるいし", "かわらずのいし", "がんせきプレート", "きあいのタスキ", "きあいのハチマキ", "きせきのタネ", "きゅうこん", "きれいなぬけがら", "ぎんのこな", "くちたけん", "くちたたて", "くっつきバリ", "グラスシード", "グランドコート", "クリアチャーム", "くろいてっきゅう", "くろいヘドロ", "くろいメガネ", "くろおび", "けむりだま", "こうかくレンズ", "こうこうのしっぽ", "こうてつプレート", "こだわりスカーフ", "こだわりハチマキ", "こだわりメガネ", "ゴツゴツメット", "こぶしのプレート", "こわもてプレート", "こんごうだま", "サイコシード", "さらさらいわ", "しあわせタマゴ", "じしゃく", "しずくプレート", "しめつけバンド", "しめったいわ", "じゃくてんほけん", "じゅうでんち", "しらたま", "シルクのスカーフ", "しろいハーブ", "しんかのきせき", "しんぴのしずく", "スピードパウダー", "するどいくちばし", "するどいツメ", "せいれいプレート", "せんせいのツメ", "だいこんごうだま", "だいしらたま", "だいちのプレート", "だいはっきんだま", "だっしゅつパック", "だっしゅつボタン", "たつじんのおび", "たべのこし", "たまむしプレート", "ちからのハチマキ", "つめたいいわ", "つららのプレート", "でんきだま", "とくせいガード", "どくどくだま", "どくバリ", "とけないこおり", "とつげきチョッキ", "ねばりのかぎづめ", "ねらいのまと", "ノーマルジュエル", "のどスプレー", "のろいのおふだ", "はっきんだま", "パワーアンクル", "パワーウエイト", "パワーバンド", "パワーベルト", "パワーリスト", "パワーレンズ", "パワフルハーブ", "パンチグローブ", "ばんのうがさ", "ひかりごけ", "ひかりのこな", "ひかりのねんど", "ひのたまプレート", "ビビリだま", "ピントレンズ", "ブーストエナジー", "ふうせん", "フォーカスレンズ", "ふしぎのプレート", "ぼうじんゴーグル", "まがったスプーン", "ミストシード", "みどりのプレート", "メタルコート", "メタルパウダー", "メトロノーム", "メンタルハーブ", "もうどくプレート", "もくたん", "ものしりメガネ", "もののけプレート", "ものまねハーブ", "やすらぎのすず", "やわらかいすな", "ゆきだま", "りゅうのキバ", "りゅうのプレート", "ルームサービス", "レッドカード", "ようせいのハネ", "いしずえのめん", "いどのめん", "かまどのめん", "するどいキバ", "アッキのみ", "イアのみ", "イトケのみ", "イバンのみ", "ウイのみ", "ウタンのみ", "オッカのみ", "オボンのみ", "オレンのみ", "カゴのみ", "カシブのみ", "カムラのみ", "キーのみ", "クラボのみ", "サンのみ", "ジャポのみ", "シュカのみ", "ズアのみ", "スターのみ", "ソクノのみ", "タラプのみ", "タンガのみ", "チーゴのみ", "チイラのみ", "ナゾのみ", "ナナシのみ", "ナモのみ", "バコウのみ", "ハバンのみ", "バンジのみ", "ビアーのみ", "ヒメリのみ", "フィラのみ", "ホズのみ", "マゴのみ", "ミクルのみ", "モモンのみ", "ヤタピのみ", "ヤチェのみ", "ヨプのみ", "ヨロギのみ", "ラムのみ", "リュガのみ", "リリバのみ", "リンドのみ", "レンブのみ", "ロゼルのみ"]
let touple = [...document.querySelectorAll("table tr:has(td)")].map(e => {
    return [e.querySelectorAll("td")[0].innerText, e.querySelectorAll("td")[1].innerText]
})
filter_item.forEach(e => {
    let index = touple.map(e => e[0]).indexOf(e)
    if (index !== -1) {
        text += touple[index][0] + "," + touple[index][1] + "\n"
    }
})
console.log(text)

/* 簡略版 */
text = ""
touple = [...document.querySelectorAll("table tr:has(td)")].map(e => {
    return [e.querySelectorAll("td")[0].innerText, e.querySelectorAll("td")[1].innerText]
})
touple.forEach((e, index) => {
    text += touple[index][0] + "," + touple[index][1] + "\n"

})
console.log(text)